---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BasePoint
source: html/f557779b-4e6c-b333-34bb-ed83bce71df9.htm
---
# BasePoint Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.